tutorials/myLusgsFoam/naca2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4.4e6;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    "(inlet|outlet).*"
    {
        type            omegaViscosityRatio;
        ratio           10;
        value           uniform 4.4e6;
    }

    "w_.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
