tutorials/myLusgsFoam/naca2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Mesh size (3N x N x 1)
N 50;

vertices        
(
    (0 0 0) // 0
    (1 0 0) // 1
    (2 0 0) // 2
    (3 0 0) // 3
    
    (0 1 0) // 4
    (1 1 0) // 5
    (2 1 0) // 6
    (3 1 0) // 7
    
    (0 0 1) // 8
    (1 0 1) // 9
    (2 0 1) // 10
    (3 0 1) // 11
    
    (0 1 1) // 12
    (1 1 1) // 13
    (2 1 1) // 14
    (3 1 1) // 15
);

blocks          
(
    hex (0 1 5 4 8 9 13 12 ) ($N $N 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13 ) ($N $N 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14 ) ($N $N 1) simpleGrading (1 1 1)
);

edges           
(
 arc 1 2 ( 1.5 0.1 0 )
 arc 9 10 ( 1.5 0.1 1 )
);

patches         
(
    empty emptyPlanes 
    (
     (0 1 5 4 ) 
     (1 2 6 5 ) 
     (2 3 7 6 ) 
     ( 8 9 13 12 )
     ( 9 10 14 13 ) 
     ( 10 11 15 14 ) 
    )
    wall lowerWall
    (
     ( 0 1 9 8 )
     ( 1 2 10 9 )
     ( 2 3 11 10 )
    )
    wall upperWall
    (
     ( 4 5 13 12 )
     ( 5 6 14 13 )
     ( 6 7 15 14 )   
    )
    patch inlet 
    (
     ( 0 4 12 8 )   
    )
    patch outlet
    (
     ( 3 7 15 11 )   
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
