tutorials/myLusgsFoam/naca2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  rho 
    {
      solver diag;
    }

  rhoU 
    {
      solver diag;
    }

  rhoE 
    {
      solver diag;
    }
    
    "(k|omega|epsilon|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        minIter         1;
        maxIter         20;
    };
    
     yPsi
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.0;
    }
  
}


LUSGS 
{
  internalIterations 1;
  localTimestepping true;
}

fieldBounds
{
    rho 0.01 10;
    p   100 1e6;
    T   10 800;
}

relaxationFactors
{
    equations
    {
        k               0.7;
        omega           0.7;
    }
}


// ************************************************************************* //
